Revit 2027 API
FabricationConfiguration.CheckConnectionsForAllFabricationParts Method
 Checks the connections for all fabrication parts in the current project. It will create reviewable warnings for all bad connections found. The checks are looking for bad alignments or gaps, incompatible connection types, mismatches of size, mismatches of shapes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int CheckConnectionsForAllFabricationParts()
Public Function CheckConnectionsForAllFabricationParts As Integer
public:
int CheckConnectionsForAllFabricationParts()
member CheckConnectionsForAllFabricationParts : unit -> int
Return Value
Int32
 The number of bad connections found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace